Revit 2026 API

# UIControlledApplicationCreateRibbonTab Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void CreateRibbonTab(
	string tabName
)
```
```vb
Public Overridable Sub CreateRibbonTab (
	tabName As String
)
```
```cpp
public:
virtual void CreateRibbonTab(
	String^ tabName
)
```
```fsharp
abstract CreateRibbonTab :
        tabName : string -> unit
override CreateRibbonTab :
        tabName : string -> unit
```

#### Parameters

tabName String

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace